#include <msp430.h>
#include "LCDJ204A.h"

// *************************************************************************
//                    系统时钟初始化
// *************************************************************************
void Clock_Init()
{

}
// *************************************************************************
//              MSP430内部看门狗初始化
// *************************************************************************
void WDT_Init()
{
	WDTCTL = WDTPW + WDTHOLD;       // 关闭看门狗
}

// *************************************************************************
//			初始化IO口子程序
// *************************************************************************
void Port_init()
{

	P2SEL = 0x00;
	P2DIR = 0xFF;
	P3SEL = 0x00;
	P3DIR|= BIT7 + BIT5 + BIT6;     // 控制口设置为输出模式
}


//***********************************************************************
//      主程序
//***********************************************************************
void main(void)
{
     unsigned char i,a=0,*p;
     WDT_Init();                         // 看门狗设置
     Clock_Init();                       // 系统时钟设置
     Port_init();                        // 系统初始化，设置IO口属性
     // delay_ms(100);                   // 延时100ms，等待启动
     LCD_init();                         // 液晶参数初始化设置
     // LCD_clear();                     // 清屏
     while (1)
      {
		i = 1;
		p = "carlnerv.com";                // 字符串输出显示
		LCD_clear();
		LCD_write_str(a++,0,"Welcome");
		if(a>5)a=0;
		delay_ms(250);
		while (*p)
		{
			LCD_write_char(i,1,*p);      // 单个字符输出显示
			i ++;
			p ++;
			delay_ms(250);               // 延时250ms
		}
		delay_ms(250);
      }
}

